tests/support/stripe_sub.json

{
  "id": "sub_0PM51qfqGyWN1S0V0rswhP9W",
  "object": "subscription",
  "application": "null",
  "application_fee_percent": "null",
  "automatic_tax": {
    "enabled": false,
    "liability": "null"
  },
  "billing_cycle_anchor": 1717060330,
  "billing_cycle_anchor_config": "null",
  "billing_thresholds": "null",
  "cancel_at": "null",
  "cancel_at_period_end": false,
  "canceled_at": "null",
  "cancellation_details": {
    "comment": "null",
    "feedback": "null",
    "reason": "null"
  },
  "collection_method": "charge_automatically",
  "created": 1717060330,
  "currency": "usd",
  "current_period_end": 1748596330,
  "current_period_start": 1717060330,
  "customer": "cus_QCTzKR5Tb8qUUR",
  "days_until_due": "null",
  "default_payment_method": "null",
  "default_source": "null",
  "default_tax_rates": [],
  "description": "null",
  "discount": "null",
  "discounts": [],
  "ended_at": "null",
  "invoice_settings": {
    "account_tax_ids": "null",
    "issuer": {
      "type": "self"
    }
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_QCTzth3suDDiWS",
        "object": "subscription_item",
        "billing_thresholds": "null",
        "created": 1717060330,
        "discounts": [],
        "metadata": {},
        "plan": {
          "id": "price_0LjQbSfqGyWN1S0VZHKLfRlJ",
          "object": "plan",
          "active": true,
          "aggregate_usage": "null",
          "amount": 14900,
          "amount_decimal": "14900",
          "billing_scheme": "per_unit",
          "created": 1663519462,
          "currency": "usd",
          "interval": "year",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "meter": "null",
          "nickname": "Yearly",
          "product": "prod_MJTyyyzEfyu7vr",
          "tiers": "null",
          "tiers_mode": "null",
          "transform_usage": "null",
          "trial_period_days": "null",
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_0LjQbSfqGyWN1S0VZHKLfRlJ",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1663519462,
          "currency": "usd",
          "custom_unit_amount": "null",
          "livemode": true,
          "lookup_key": "null",
          "metadata": {},
          "nickname": "Yearly",
          "product": "prod_MJTyyyzEfyu7vr",
          "recurring": {
            "aggregate_usage": "null",
            "interval": "year",
            "interval_count": 1,
            "meter": "null",
            "trial_period_days": "null",
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": "null",
          "transform_quantity": "null",
          "type": "recurring",
          "unit_amount": 14900,
          "unit_amount_decimal": "14900"
        },
        "quantity": 1,
        "subscription": "sub_0PM51qfqGyWN1S0V0rswhP9W",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_0PM51qfqGyWN1S0V0rswhP9W"
  },
  "latest_invoice": "in_0PM51qfqGyWN1S0Vn1he3jLI",
  "livemode": true,
  "metadata": {},
  "next_pending_invoice_item_invoice": "null",
  "on_behalf_of": "null",
  "pause_collection": "null",
  "payment_settings": {
    "payment_method_options": {
      "acss_debit": "null",
      "bancontact": "null",
      "card": {
        "network": "null",
        "request_three_d_secure": "automatic"
      },
      "customer_balance": "null",
      "konbini": "null",
      "sepa_debit": "null",
      "us_bank_account": "null"
    },
    "payment_method_types": "null",
    "save_default_payment_method": "off"
  },
  "pending_invoice_item_interval": "null",
  "pending_setup_intent": "null",
  "pending_update": "null",
  "plan": {
    "id": "price_0LjQbSfqGyWN1S0VZHKLfRlJ",
    "object": "plan",
    "active": true,
    "aggregate_usage": "null",
    "amount": 14900,
    "amount_decimal": "14900",
    "billing_scheme": "per_unit",
    "created": 1663519462,
    "currency": "usd",
    "interval": "year",
    "interval_count": 1,
    "livemode": true,
    "metadata": {},
    "meter": "null",
    "nickname": "Yearly",
    "product": "prod_MJTyyyzEfyu7vr",
    "tiers": "null",
    "tiers_mode": "null",
    "transform_usage": "null",
    "trial_period_days": "null",
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": "null",
  "start_date": 1717060330,
  "status": "incomplete",
  "tax_percent": "null",
  "test_clock": "null",
  "transfer_data": "null",
  "trial_end": "null",
  "trial_settings": {
    "end_behavior": {
      "missing_payment_method": "create_invoice"
    }
  },
  "trial_start": "null"
}
